; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob61) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate5)
	(at pallet1 distributor0)
	(clear crate3)
	(at pallet2 distributor1)
	(clear crate8)
	(at truck0 distributor0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 408)
	(at truck1 distributor1)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 224)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 depot0)
	(on crate0 pallet0)
	(= (weight crate0) 95)
	(at crate1 distributor1)
	(on crate1 pallet2)
	(= (weight crate1) 22)
	(at crate2 depot0)
	(on crate2 crate0)
	(= (weight crate2) 56)
	(at crate3 distributor0)
	(on crate3 pallet1)
	(= (weight crate3) 99)
	(at crate4 distributor1)
	(on crate4 crate1)
	(= (weight crate4) 23)
	(at crate5 depot0)
	(on crate5 crate2)
	(= (weight crate5) 91)
	(at crate6 distributor1)
	(on crate6 crate4)
	(= (weight crate6) 38)
	(at crate7 distributor1)
	(on crate7 crate6)
	(= (weight crate7) 16)
	(at crate8 distributor1)
	(on crate8 crate7)
	(= (weight crate8) 54)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate4)
		(on crate1 crate7)
		(on crate2 pallet1)
		(on crate4 pallet2)
		(on crate6 crate1)
		(on crate7 pallet0)
		(on crate8 crate6)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist1 crate3 pallet1 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist1) (on crate3 pallet1)
   added: (lifting hoist1 crate3) (clear pallet1)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 7
2. (load hoist1 crate3 truck0 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 99
   goals met: 0 of 7
3. (lift hoist0 crate5 crate2 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist0) (on crate5 crate2)
   added: (lifting hoist0 crate5) (clear crate2)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 7
4. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 2 to 12
   goals met: 0 of 7
5. (load hoist0 crate5 truck0 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck0) (available hoist0)
   changed: (current_load truck0) from 99 to 190
   goals met: 0 of 7
6. (lift hoist0 crate2 crate0 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 crate0)
   added: (lifting hoist0 crate2) (clear crate0)
   changed: (fuel-cost) from 12 to 13
   goals met: 0 of 7
7. (load hoist0 crate2 truck0 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck0) (available hoist0)
   changed: (current_load truck0) from 190 to 246
   goals met: 0 of 7
8. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet0)
   added: (lifting hoist0 crate0) (clear pallet0)
   changed: (fuel-cost) from 13 to 14
   goals met: 0 of 7
9. (load hoist0 crate0 truck0 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck0) (available hoist0)
   changed: (current_load truck0) from 246 to 341
   goals met: 0 of 7
10. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 14 to 24
   goals met: 0 of 7
11. (unload hoist1 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist1)
   added: (lifting hoist1 crate2)
   changed: (current_load truck0) from 341 to 285
   goals met: 0 of 7
12. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 24 to 34
   goals met: 0 of 7
13. (drop hoist1 crate2 pallet1 distributor0)
   deleted: (lifting hoist1 crate2) (clear pallet1)
   added: (available hoist1) (at crate2 distributor0) (clear crate2) (on crate2 pallet1)
   goals met: 1 of 7
14. (lift hoist2 crate8 crate7 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist2) (on crate8 crate7)
   added: (lifting hoist2 crate8) (clear crate7)
   changed: (fuel-cost) from 34 to 35
   goals met: 1 of 7
15. (load hoist2 crate8 truck1 distributor1)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck1) (available hoist2)
   changed: (current_load truck1) from 0 to 54
   goals met: 1 of 7
16. (lift hoist2 crate7 crate6 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist2) (on crate7 crate6)
   added: (lifting hoist2 crate7) (clear crate6)
   changed: (fuel-cost) from 35 to 36
   goals met: 1 of 7
17. (load hoist2 crate7 truck0 distributor1)
   deleted: (lifting hoist2 crate7)
   added: (in crate7 truck0) (available hoist2)
   changed: (current_load truck0) from 285 to 301
   goals met: 1 of 7
18. (unload hoist2 crate8 truck1 distributor1)
   deleted: (in crate8 truck1) (available hoist2)
   added: (lifting hoist2 crate8)
   changed: (current_load truck1) from 54 to 0
   goals met: 1 of 7
19. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 36 to 46
   goals met: 1 of 7
20. (unload hoist0 crate7 truck0 depot0)
   deleted: (in crate7 truck0) (available hoist0)
   added: (lifting hoist0 crate7)
   changed: (current_load truck0) from 301 to 285
   goals met: 1 of 7
21. (load hoist2 crate8 truck1 distributor1)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck1) (available hoist2)
   changed: (current_load truck1) from 0 to 54
   goals met: 1 of 7
22. (lift hoist2 crate6 crate4 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist2) (on crate6 crate4)
   added: (lifting hoist2 crate6) (clear crate4)
   changed: (fuel-cost) from 46 to 47
   goals met: 1 of 7
23. (load hoist2 crate6 truck1 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck1) (available hoist2)
   changed: (current_load truck1) from 54 to 92
   goals met: 1 of 7
24. (lift hoist2 crate4 crate1 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist2) (on crate4 crate1)
   added: (lifting hoist2 crate4) (clear crate1)
   changed: (fuel-cost) from 47 to 48
   goals met: 1 of 7
25. (load hoist2 crate4 truck1 distributor1)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck1) (available hoist2)
   changed: (current_load truck1) from 92 to 115
   goals met: 1 of 7
26. (drop hoist0 crate7 pallet0 depot0)
   deleted: (lifting hoist0 crate7) (clear pallet0)
   added: (available hoist0) (at crate7 depot0) (clear crate7) (on crate7 pallet0)
   goals met: 2 of 7
27. (lift hoist2 crate1 pallet2 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist2) (on crate1 pallet2)
   added: (lifting hoist2 crate1) (clear pallet2)
   changed: (fuel-cost) from 48 to 49
   goals met: 2 of 7
28. (load hoist2 crate1 truck1 distributor1)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck1) (available hoist2)
   changed: (current_load truck1) from 115 to 137
   goals met: 2 of 7
29. (unload hoist2 crate4 truck1 distributor1)
   deleted: (in crate4 truck1) (available hoist2)
   added: (lifting hoist2 crate4)
   changed: (current_load truck1) from 137 to 114
   goals met: 2 of 7
30. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 49 to 59
   goals met: 2 of 7
31. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 59 to 69
   goals met: 2 of 7
32. (drop hoist2 crate4 pallet2 distributor1)
   deleted: (lifting hoist2 crate4) (clear pallet2)
   added: (available hoist2) (at crate4 distributor1) (clear crate4) (on crate4 pallet2)
   goals met: 3 of 7
33. (unload hoist2 crate0 truck0 distributor1)
   deleted: (in crate0 truck0) (available hoist2)
   added: (lifting hoist2 crate0)
   changed: (current_load truck0) from 285 to 190
   goals met: 3 of 7
34. (drop hoist2 crate0 crate4 distributor1)
   deleted: (lifting hoist2 crate0) (clear crate4)
   added: (available hoist2) (at crate0 distributor1) (clear crate0) (on crate0 crate4)
   goals met: 4 of 7
35. (unload hoist0 crate1 truck1 depot0)
   deleted: (in crate1 truck1) (available hoist0)
   added: (lifting hoist0 crate1)
   changed: (current_load truck1) from 114 to 92
   goals met: 4 of 7
36. (drop hoist0 crate1 crate7 depot0)
   deleted: (lifting hoist0 crate1) (clear crate7)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 crate7)
   goals met: 5 of 7
37. (unload hoist0 crate6 truck1 depot0)
   deleted: (in crate6 truck1) (available hoist0)
   added: (lifting hoist0 crate6)
   changed: (current_load truck1) from 92 to 54
   goals met: 5 of 7
38. (drop hoist0 crate6 crate1 depot0)
   deleted: (lifting hoist0 crate6) (clear crate1)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 crate1)
   goals met: 6 of 7
39. (unload hoist0 crate8 truck1 depot0)
   deleted: (in crate8 truck1) (available hoist0)
   added: (lifting hoist0 crate8)
   changed: (current_load truck1) from 54 to 0
   goals met: 6 of 7
40. (drop hoist0 crate8 crate6 depot0)
   deleted: (lifting hoist0 crate8) (clear crate6)
   added: (available hoist0) (at crate8 depot0) (clear crate8) (on crate8 crate6)
   goals met: 7 of 7
